tudou13/SignalReplay/msp430_RF_transmit_door_signal.c
#include <msp430.h> 

//这个宏仅针对8MHz
#define delay_us(us) __delay_cycles(8*(us))
#define delay_ms(ms) __delay_cycles(8000*(ms))

int main(void) {
    WDTCTL = WDTPW | WDTHOLD;	// Stop watchdog timer

	BCSCTL1 = CALBC1_8MHZ;     //设置 DCO 频率为8MHz
	DCOCTL = CALDCO_8MHZ;

    char close_door_signal[129]={'1','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0',
    		'1','1','1','0','1','0','0','0','1','0','0','0','1','0','0','0','1','1','1','0','1','0','0','0','1','0','0','0','1','0','0','0','1','0','0',
    		'0','1','1','1','0','1','0','0','0','1','1','1','0','1','0','0','0','1','1','1','0','1','1','1','0','1','1','1','0','1','1','1','0','1','1',
    		'1','0','1','1','1','0','1','1','1','0','1','0','0','0','1','1','1','0','1','0','0','0','1','0','0','0'};
    int i;
	P1DIR |= 0x01;// Set P1.0 to output direction
	P1OUT = 0x00;//low voltage
	delay(1000);

    while(1){
    	P1OUT = 0x00;//low voltage
    	delay_us(333);
    	for(i=0;i<129;i++){
    		(close_door_signal[i]=='1')?(P1OUT=0x01):(P1OUT=0x00);
    		delay_us(333);// 1.333ms/4=333.25ms
    	}
    }

	return 0;
}

/*
//原来的使用默认时钟设置的程序
#include <msp430.h> 

void delay(int num) {
	do {
		_NOP();
	} while (num--);
}

int main(void) {
	WDTCTL = WDTPW | WDTHOLD;        // Stop watchdog timer

	char close_door_signal[129] = { '1', '0', '0', '0', '0', '0', '0', '0', '0',
			'0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0',
			'0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '1', '1', '1',
			'0', '1', '0', '0', '0', '1', '0', '0', '0', '1', '0', '0', '0',
			'1', '1', '1', '0', '1', '0', '0', '0', '1', '0', '0', '0', '1',
			'0', '0', '0', '1', '0', '0', '0', '1', '1', '1', '0', '1', '0',
			'0', '0', '1', '1', '1', '0', '1', '0', '0', '0', '1', '1', '1',
			'0', '1', '1', '1', '0', '1', '1', '1', '0', '1', '1', '1', '0',
			'1', '1', '1', '0', '1', '1', '1', '0', '1', '1', '1', '0', '1',
			'0', '0', '0', '1', '1', '1', '0', '1', '0', '0', '0', '1', '0',
			'0', '0' };        //关门信号
	int i;
	P1DIR |= 0x01;        // Set P1.0 to output direction
	P1OUT = 0x00;        //low voltage
	delay(1000);

	while (1) {
		P1OUT = 0x00;        //low voltage
		delay(50);        //这个50由逻辑分析仪分析单片机电平输出后试出来
		for (i = 0; i < 129; i++) {
			(close_door_signal[i] == '1') ? (P1OUT = 0x01) : (P1OUT = 0x00);
			delay(50);
		}
	}

	return 0;
}
*/
